### [Documentation Python SQL Libraries](https://realpython.com/python-sql-libraries/)

In [1]:
import sqlite3
from sqlite3 import Error

### Hacer conexi√≥n a la base de datos

In [2]:
path = './'
connection = sqlite3.connect(path + 'mi_db.sqlite')

### Crear tablas 

Solo su estructura, por ahora sin valores.

In [3]:
create_users_table = """
CREATE TABLE IF NOT EXISTS users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT NOT NULL,
  age INTEGER,
  gender TEXT,
  nationality TEXT
);
"""

In [4]:
cursor = connection.cursor()
cursor.execute(create_users_table)
connection.commit()

In [5]:
create_posts_table = """
CREATE TABLE IF NOT EXISTS posts(
  id INTEGER PRIMARY KEY AUTOINCREMENT, 
  title TEXT NOT NULL, 
  description TEXT NOT NULL, 
  user_id INTEGER NOT NULL, 
  FOREIGN KEY (user_id) REFERENCES users (id)
);
"""

In [6]:
cursor.execute(create_posts_table)
connection.commit()

In [7]:
create_comments_table = """
CREATE TABLE IF NOT EXISTS comments (
  id INTEGER PRIMARY KEY AUTOINCREMENT, 
  text TEXT NOT NULL, 
  user_id INTEGER NOT NULL, 
  post_id INTEGER NOT NULL, 
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

create_likes_table = """
CREATE TABLE IF NOT EXISTS likes (
  id INTEGER PRIMARY KEY AUTOINCREMENT, 
  user_id INTEGER NOT NULL, 
  post_id integer NOT NULL, 
  FOREIGN KEY (user_id) REFERENCES users (id) FOREIGN KEY (post_id) REFERENCES posts (id)
);
"""

cursor.execute(create_comments_table)
cursor.execute(create_likes_table)
connection.commit()

## Insertar valores

In [8]:
create_users = """
INSERT INTO
  users (name, age, gender, nationality)
VALUES
  ('James', 25, 'male', 'USA'),
  ('Leila', 32, 'female', 'France'),
  ('Brigitte', 35, 'female', 'England'),
  ('Mike', 40, 'male', 'Denmark'),
  ('Elizabeth', 21, 'female', 'Canada');
"""

cursor.execute(create_users)

In [9]:
create_posts = """
INSERT INTO
  posts (title, description, user_id)
VALUES
  ("Happy", "I am feeling very happy today", 1),
  ("Hot Weather", "The weather is very hot today", 2),
  ("Help", "I need some help with my work", 2),
  ("Great News", "I am getting married", 1),
  ("Interesting Game", "It was a fantastic game of tennis", 5),
  ("Party", "Anyone up for a late-night party today?", 3);
"""

create_comments = """
INSERT INTO
  comments (text, user_id, post_id)
VALUES
  ('Count me in', 1, 6),
  ('What sort of help?', 5, 3),
  ('Congrats buddy', 2, 4),
  ('I was rooting for Nadal though', 4, 5),
  ('Help with your thesis?', 2, 3),
  ('Many congratulations', 5, 4);
"""

create_likes = """
INSERT INTO
  likes (user_id, post_id)
VALUES
  (1, 6),
  (2, 3),
  (1, 5),
  (5, 4),
  (2, 4),
  (4, 2),
  (3, 6);
"""

cursor.execute(create_posts) 
cursor.execute(create_comments) 
cursor.execute(create_likes) 
connection.commit()

## Extraer datos

In [10]:
select_users = "SELECT * from users"
users = cursor.execute(select_users)

for user in users:
    print(user)

(1, 'James', 25, 'male', 'USA')
(2, 'Leila', 32, 'female', 'France')
(3, 'Brigitte', 35, 'female', 'England')
(4, 'Mike', 40, 'male', 'Denmark')
(5, 'Elizabeth', 21, 'female', 'Canada')

In [11]:
type(users)

sqlite3.Cursor

In [12]:
import pandas as pd 

pd.read_sql("""SELECT * FROM users;""", connection)

   id       name  age  gender nationality
0   1      James   25    male         USA
1   2      Leila   32  female      France
2   3   Brigitte   35  female     England
3   4       Mike   40    male     Denmark
4   5  Elizabeth   21  female      Canada

In [13]:
pd.read_sql("""SELECT * FROM posts;""", connection)

   id             title                              description  user_id
0   1             Happy            I am feeling very happy today        1
1   2       Hot Weather            The weather is very hot today        2
2   3              Help            I need some help with my work        2
3   4        Great News                     I am getting married        1
4   5  Interesting Game        It was a fantastic game of tennis        5
5   6             Party  Anyone up for a late-night party today?        3

In [14]:
pd.read_sql("""SELECT * FROM comments;""", connection)

   id                            text  user_id  post_id
0   1                     Count me in        1        6
1   2              What sort of help?        5        3
2   3                  Congrats buddy        2        4
3   4  I was rooting for Nadal though        4        5
4   5          Help with your thesis?        2        3
5   6            Many congratulations        5        4

In [15]:
pd.read_sql("""SELECT * FROM likes;""", connection)

   id  user_id  post_id
0   1        1        6
1   2        2        3
2   3        1        5
3   4        5        4
4   5        2        4
5   6        4        2
6   7        3        6

## Eliminar/Modificar registros/campos

In [16]:
pd.read_sql("""SELECT * FROM posts;""", connection)

   id             title                              description  user_id
0   1             Happy            I am feeling very happy today        1
1   2       Hot Weather            The weather is very hot today        2
2   3              Help            I need some help with my work        2
3   4        Great News                     I am getting married        1
4   5  Interesting Game        It was a fantastic game of tennis        5
5   6             Party  Anyone up for a late-night party today?        3

#### Modificar

> UPDATE tabla \
> SET col1 = valor, col2 = valor2, col5 = valor5 \
> WHERE condiciones;

In [17]:
update_posts = """
UPDATE posts
SET title = "titulo modificado", description = "campo modificado tambien"
WHERE id = 2;
"""

In [18]:
cursor.execute(update_posts)
connection.commit()

In [19]:
pd.read_sql("""SELECT * FROM posts;""", connection)

   id              title                              description  user_id
0   1              Happy            I am feeling very happy today        1
1   2  titulo modificado                 campo modificado tambien        2
2   3               Help            I need some help with my work        2
3   4         Great News                     I am getting married        1
4   5   Interesting Game        It was a fantastic game of tennis        5
5   6              Party  Anyone up for a late-night party today?        3

In [ ]:
#update_posts = """
#UPDATE posts
#SET title = "titulo modificado", description = "campo modificado tambien";
#"""
#cursor.execute(update_posts)
#connection.commit()

#pd.read_sql("""SELECT * FROM posts;""", connection)

In [20]:
update_users = """
UPDATE users
SET age = age*10;
"""
cursor.execute(update_users)
connection.commit()

In [21]:
pd.read_sql("""SELECT * FROM users;""", connection)

   id       name  age  gender nationality
0   1      James  250    male         USA
1   2      Leila  320  female      France
2   3   Brigitte  350  female     England
3   4       Mike  400    male     Denmark
4   5  Elizabeth  210  female      Canada

#### Eliminar

> ALTER TABLE tabla \
> DROP COLUMN col4

In [22]:
drop_users_age = """
ALTER TABLE users
DROP COLUMN gender;
"""

cursor.execute(drop_users_age)
connection.commit()

In [23]:
pd.read_sql("""SELECT * FROM users;""", connection)

   id       name  age nationality
0   1      James  250         USA
1   2      Leila  320      France
2   3   Brigitte  350     England
3   4       Mike  400     Denmark
4   5  Elizabeth  210      Canada

### Ejercicio: 

#### Eliminar los registros donde el nombre termina con la letra 'e'.

In [24]:
delete_registros = """
DELETE FROM users
WHERE name LIKE '%e';
"""

cursor.execute(delete_registros)
connection.commit()

In [25]:
pd.read_sql("""SELECT * FROM users;""", connection)

   id       name  age nationality
0   1      James  250         USA
1   2      Leila  320      France
2   5  Elizabeth  210      Canada

### Ejercicio: 

#### Investigar como a√±adir dos columnas nuevas a la tabla **users** 
 1) con valores 5*cualquier_OtraCol_numerica
 2) valores de una columna de otra tabla

In [26]:
# sqlite no permite a√±adir multiple columnas de manera simultanea
insert_cols = """
ALTER TABLE users
ADD COLUMN new_local INTEGER;
"""
cursor.execute(insert_cols)

insert_cols = """
ALTER TABLE users
ADD COLUMN new_external VARCHAR(50);
"""

cursor.execute(insert_cols)

In [27]:
update_new_local = """
UPDATE users
SET new_local = age*5;
"""

update_new_external = """
UPDATE users
SET new_external = title
FROM posts
WHERE users.id = posts.user_id;
"""

cursor.execute(update_new_local)
cursor.execute(update_new_external)
connection.commit()

In [28]:
pd.read_sql("""SELECT * FROM users;""", connection)

   id       name  age nationality  new_local      new_external
0   1      James  250         USA       1250        Great News
1   2      Leila  320      France       1600              Help
2   5  Elizabeth  210      Canada       1050  Interesting Game